#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.gcr.google_project_service.api["containerregistry.googleapis.com"]: Refreshing state... [id=tbd-2023l-303731/containerregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2023l-303731/global/networks/main-vpc]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2023l-303731/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2023l-303731/global/firewalls/default-internal-allow-all]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2023l-303731/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2023l-303731/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2023l-303731/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2023l-303731/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2023l-303731/dataproc.googleapis.com]
module.gcr.google_container_registry.registry: Refreshing state... [id=eu.artifacts.tbd-2023l-303731.appspot.com]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2023l-303731/regions/europe-west1/clusters/tbd-cluster]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:9727543b6010ae30214b1c636dd389c5d3edeacc379c1468bb332c09434b390deu.gcr.io/tbd-2023l-303731/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:eb35d8b88910cf29d9244996dba3e7c3c0b43d09164dc1aa4a9b130ea3d169df]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2023l-303731/notebooks.googleapis.com]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2023l-303731-conf]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2023l-303731-conf-scripts/notebook_post_startup_script.sh]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2023l-303731-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2023l-303731/locations/europe-west1-b/instances/tbd-2023l-303731-notebook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:9727543b6010ae30214b1c636dd389c5d3edeacc379c1468bb332c09434b390deu.gcr.io/tbd-2023l-303731/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2023l-303731/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2023l-303731/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "b4e49bbc253902aa9ae493ff834444b48739d446"
        }

      + build {
          + build_args   = {
              + "JUPYTERLAB_VERSION" = "3.6.3"
              + "PROJECT_NAME"       = "tbd-2023l-303731"
            }
          + cache_from   = []
          + context      = "modules/docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2023l-303731/jupyter:latest",
            ]
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2023l-303731"
      + skip_delete         = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook must be replaced
-/+ resource "google_notebooks_instance" "tbd_notebook" {
      ~ create_time            = "2023-05-18T14:27:28.599705318Z" -> (known after apply)
      ~ id                     = "projects/tbd-2023l-303731/locations/europe-west1-b/instances/tbd-2023l-303731-notebook" -> (known after apply)
      - install_gpu_driver     = false -> null
      ~ labels                 = {
          - "goog-caip-notebook" = ""
        } -> (known after apply)
        name                   = "tbd-2023l-303731-notebook"
      ~ network                = "https://www.googleapis.com/compute/v1/projects/tbd-2023l-303731/global/networks/main-vpc" -> "projects/tbd-2023l-303731/global/networks/main-vpc"
      ~ no_proxy_access        = false -> true # forces replacement
      ~ project                = "tbd-2023l-303731" -> (known after apply)
      ~ proxy_uri              = "7d00d109bfc93c4d-dot-europe-west1.notebooks.googleusercontent.com" -> (known after apply)
      ~ service_account        = "339537136418-compute@developer.gserviceaccount.com" -> (known after apply)
      - service_account_scopes = [] -> null
      ~ state                  = "ACTIVE" -> (known after apply)
      ~ subnet                 = "https://www.googleapis.com/compute/v1/projects/tbd-2023l-303731/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2023l-303731/regions/europe-west1/subnetworks/subnet-01"
      - tags                   = [] -> null
      ~ update_time            = "2023-05-18T14:31:41.438241465Z" -> (known after apply)
        # (5 unchanged attributes hidden)

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }

        # (1 unchanged block hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2023l-303731-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:339537136418-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @RouNNdeL, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*